/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   get_arg_from_map.c                                 :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: bdomansk <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/02/28 17:36:20 by bdomansk          #+#    #+#             */
/*   Updated: 2019/02/28 17:36:22 by bdomansk         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "corewar.h"

/*
** Функция принимает 3 параметра :
** Карта, с которой необходимо достать аргументы;
** Позиция на карте, с которой мы начнем считывать аргументы;
** Количество байтов, которые нужно считать.
** Пока количество байтов больше нуля происходит следующее:
** Уменьшаем количество байтов;
** Записываем во временую переменую аргумент/байт на карте и выполняем
** побитовый сдвиг на количесвто байтов которе осталось * 8 (8бит);
** Выполняем побитовое "ИЛИ" между результатом и временной переменной, и
** записываем результат в result.
**
** Пример: пусть мы получаем карту (00 10 0а 1b ff), позицию 1 и кол-во байт 4
** temp = 0000 0000 0000 0000 0000 0000 0001 0000 << 3 * 8 =
** = 0001 0000 0000 0000 0000 0000 0000 0000
** result = result | temp
** result = 0001 0000 0000 0000 0000 0000 0000 0000
** temp = 0000 0000 0000 0000 0000 0000 0000 1010
** result = result | temp
** result = 0001 0000 0000 1010 0000 0000 0000 0000
** temp = 0000 0000 0000 0000 0000 0000 0001 1011
** result = result | temp
** result = 0001 0000 0000 1010 0001 1011 0000 0000
** temp = 0000 0000 0000 0000 0000 0000 1111 1111
** result = result | temp
** result = 0001 0000 0000 1010 0001 1011 1111 1111 == 0x100a1bff
*/

unsigned int	get_arg_from_map(t_map *map, unsigned int pos, int size)
{
	unsigned int	result;
	unsigned int	temp;

	result = 0;
	while (size > 0)
	{
		size--;
		temp = (unsigned int)(map[pos % MEM_SIZE].cell) << (size * 8);
		result = result | temp;
		pos++;
	}
	return (result);
}
